In [2]:
print("Welcome Pandas!")

Welcome Pandas!

In [3]:
import pandas as pd
s = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
df = pd.DataFrame({"names":["Harry","Rohan","Shubham"], "marks":[100,53,45]})
print(df)

     names  marks
0    Harry    100
1    Rohan     53
2  Shubham     45

In [5]:
df = pd.read_csv("D:\CODING PRTK\Python\Pandas\employee_data.csv")
print(df)

   employee_id          name  age   department         designation  salary  \
0          101   Amit Sharma   26  Engineering   Software Engineer   60000
1          102   Priya Verma   29    Marketing   Marketing Analyst   55000
2          103   Rahul Singh   35  Engineering    Senior Developer   95000
3          104    Neha Gupta   24           HR        HR Executive   42000
4          105   Karan Mehta   31      Finance   Financial Analyst   70000
5          106    Sneha Iyer   28  Engineering   Backend Developer   68000
6          107   Arjun Patel   40   Management     Project Manager  120000
7          108   Riya Kapoor   27       Design      UI/UX Designer   58000
8          109  Manish Kumar   33  Engineering     DevOps Engineer   85000
9          110    Ananya Roy   25    Marketing  Content Strategist   48000

   experience_years       city joining_date
0                 2  Bangalore   2022-07-15
1                 4      Delhi   2020-03-10
2                10       Pune   2015-11-01
3                 1      Noida   2023-01-05
4                 6     Mumbai   2018-06-20
5                 4    Chennai   2019-09-12
6                15  Ahmedabad   2010-02-18
7                 3  Bangalore   2021-08-30
8                 8  Hyderabad   2017-04-25
9                 2    Kolkata   2022-10-10

In [6]:
print(df.head()) # show top 5 values

   employee_id         name  age   department        designation  salary  \
0          101  Amit Sharma   26  Engineering  Software Engineer   60000
1          102  Priya Verma   29    Marketing  Marketing Analyst   55000
2          103  Rahul Singh   35  Engineering   Senior Developer   95000
3          104   Neha Gupta   24           HR       HR Executive   42000
4          105  Karan Mehta   31      Finance  Financial Analyst   70000

   experience_years       city joining_date
0                 2  Bangalore   2022-07-15
1                 4      Delhi   2020-03-10
2                10       Pune   2015-11-01
3                 1      Noida   2023-01-05
4                 6     Mumbai   2018-06-20

In [7]:
print(df.tail()) # show last 5 values

   employee_id          name  age   department         designation  salary  \
5          106    Sneha Iyer   28  Engineering   Backend Developer   68000
6          107   Arjun Patel   40   Management     Project Manager  120000
7          108   Riya Kapoor   27       Design      UI/UX Designer   58000
8          109  Manish Kumar   33  Engineering     DevOps Engineer   85000
9          110    Ananya Roy   25    Marketing  Content Strategist   48000

   experience_years       city joining_date
5                 4    Chennai   2019-09-12
6                15  Ahmedabad   2010-02-18
7                 3  Bangalore   2021-08-30
8                 8  Hyderabad   2017-04-25
9                 2    Kolkata   2022-10-10

In [8]:
print(df.describe())

       employee_id        age         salary  experience_years
count     10.00000  10.000000      10.000000         10.000000
mean     105.50000  29.800000   70100.000000          5.500000
std        3.02765   5.006662   23783.514365          4.377975
min      101.00000  24.000000   42000.000000          1.000000
25%      103.25000  26.250000   55750.000000          2.250000
50%      105.50000  28.500000   64000.000000          4.000000
75%      107.75000  32.500000   81250.000000          7.500000
max      110.00000  40.000000  120000.000000         15.000000

In [9]:
print(type(df["employee_id"]))

<class 'pandas.core.series.Series'>

In [10]:
print(type(df[["employee_id","age"]]))

<class 'pandas.core.frame.DataFrame'>

In [11]:
print(df.iloc[0]) # gives first row values

employee_id                       101
name                      Amit Sharma
age                                26
department                Engineering
designation         Software Engineer
salary                          60000
experience_years                    2
city                        Bangalore
joining_date               2022-07-15
Name: 0, dtype: object

In [12]:
df.dropna() # drop those rows which have missing datas
# df.fillna(0) # to fill 0 to those places

,employee_id,name,age,department,designation,salary,experience_years,city,joining_date
0,101,Amit Sharma,26,Engineering,Software Engineer,60000,2,Bangalore,2022-07-15
1,102,Priya Verma,29,Marketing,Marketing Analyst,55000,4,Delhi,2020-03-10
2,103,Rahul Singh,35,Engineering,Senior Developer,95000,10,Pune,2015-11-01
3,104,Neha Gupta,24,HR,HR Executive,42000,1,Noida,2023-01-05
4,105,Karan Mehta,31,Finance,Financial Analyst,70000,6,Mumbai,2018-06-20
5,106,Sneha Iyer,28,Engineering,Backend Developer,68000,4,Chennai,2019-09-12
6,107,Arjun Patel,40,Management,Project Manager,120000,15,Ahmedabad,2010-02-18
7,108,Riya Kapoor,27,Design,UI/UX Designer,58000,3,Bangalore,2021-08-30
8,109,Manish Kumar,33,Engineering,DevOps Engineer,85000,8,Hyderabad,2017-04-25
9,110,Ananya Roy,25,Marketing,Content Strategist,48000,2,Kolkata,2022-10-10

In [14]:
df.rename(columns={"department": "dept"}) # dataframe changes for now only
# to change the dataframe enntirely for all do like this :
# df.rename(columns={"department": "dept"},inplace=True) # avoid using this

,employee_id,name,age,dept,designation,salary,experience_years,city,joining_date
0,101,Amit Sharma,26,Engineering,Software Engineer,60000,2,Bangalore,2022-07-15
1,102,Priya Verma,29,Marketing,Marketing Analyst,55000,4,Delhi,2020-03-10
2,103,Rahul Singh,35,Engineering,Senior Developer,95000,10,Pune,2015-11-01
3,104,Neha Gupta,24,HR,HR Executive,42000,1,Noida,2023-01-05
4,105,Karan Mehta,31,Finance,Financial Analyst,70000,6,Mumbai,2018-06-20
5,106,Sneha Iyer,28,Engineering,Backend Developer,68000,4,Chennai,2019-09-12
6,107,Arjun Patel,40,Management,Project Manager,120000,15,Ahmedabad,2010-02-18
7,108,Riya Kapoor,27,Design,UI/UX Designer,58000,3,Bangalore,2021-08-30
8,109,Manish Kumar,33,Engineering,DevOps Engineer,85000,8,Hyderabad,2017-04-25
9,110,Ananya Roy,25,Marketing,Content Strategist,48000,2,Kolkata,2022-10-10

In [19]:
# astype same as numpy
# look for data type as:
# print(df.info())
# change employee_id to str as:
df['employee_id'] = df['employee_id'].astype(str) 
print(df.info()) # converted to object since string is an Object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       10 non-null     object
 1   name              10 non-null     object
 2   age               10 non-null     int64
 3   department        10 non-null     object
 4   designation       10 non-null     object
 5   salary            10 non-null     int64
 6   experience_years  10 non-null     int64
 7   city              10 non-null     object
 8   joining_date      10 non-null     object
dtypes: int64(3), object(6)
memory usage: 848.0+ bytes
None

In [ ]:
# to determine no. of rows
print(len(df))
# to add new column
df["col1"] = [0 for i in range(len(df))]
print(df)
# to modify added column values by copying some column values to it then modifying(here squaring)
def fx(a):
    return a*a
df["col2"] = df["age"].apply(fx)

10
  employee_id          name  age   department         designation  salary  \
0         101   Amit Sharma   26  Engineering   Software Engineer   60000
1         102   Priya Verma   29    Marketing   Marketing Analyst   55000
2         103   Rahul Singh   35  Engineering    Senior Developer   95000
3         104    Neha Gupta   24           HR        HR Executive   42000
4         105   Karan Mehta   31      Finance   Financial Analyst   70000
5         106    Sneha Iyer   28  Engineering   Backend Developer   68000
6         107   Arjun Patel   40   Management     Project Manager  120000
7         108   Riya Kapoor   27       Design      UI/UX Designer   58000
8         109  Manish Kumar   33  Engineering     DevOps Engineer   85000
9         110    Ananya Roy   25    Marketing  Content Strategist   48000

   experience_years       city joining_date  col1  col2
0                 2  Bangalore   2022-07-15     0   676
1                 4      Delhi   2020-03-10     0   841
2                10       Pune   2015-11-01     0  1225
3                 1      Noida   2023-01-05     0   576
4                 6     Mumbai   2018-06-20     0   961
5                 4    Chennai   2019-09-12     0   784
6                15  Ahmedabad   2010-02-18     0  1600
7                 3  Bangalore   2021-08-30     0   729
8                 8  Hyderabad   2017-04-25     0  1089
9                 2    Kolkata   2022-10-10     0   625

In [30]:
# to save the updated csv:
df.to_csv(r"D:\CODING PRTK\Python\Pandas\updated_data.csv", index=False)
# recommended to give forward slash otherwise r for raw

In [32]:
# to concat 2 data frames
df1 = pd.DataFrame({
    "name" : ["Akash","Ram","Shyam"],
    "marks": [3,100,12]
})
df2 = pd.DataFrame({
    "name" : ["Abhishek","Puja","Karan"],
    "marks": [311,1010,11]
})
print(pd.concat([df1,df2]))

       name  marks
0     Akash      3
1       Ram    100
2     Shyam     12
0  Abhishek    311
1      Puja   1010
2     Karan     11

In [ ]:
df1 = pd.DataFrame({
    "name" : ["Akash","Priyanka","Harry"],
    "marks" : [100,53,21]
})
df2 = pd.DataFrame({
    "name" : ["Akash","Priyanka"],
    "roll" : [20,21]
})
print(pd.merge(df1,df2,on="name")) # merge on name only; if name was there on one but not on other it will not show

       name  marks  roll
0     Akash    100    20
1  Priyanka     53    21